Функция ПолучитьЦенуПоКонтаргентуИМарке(Контрагент, ТипЦены) Экспорт

	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПерсональныйПрайсЛист.Марка КАК Марка,
		|	ПерсональныйПрайсЛист.Марка.Код КАК КодМарки
		|ПОМЕСТИТЬ ВТ_Марки
		|ИЗ
		|	Справочник.ПерсональныйПрайсЛист КАК ПерсональныйПрайсЛист
		|ГДЕ
		|	ПерсональныйПрайсЛист.Владелец = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбратьБезИерархии.Родитель КАК НачалоДуги,
		|	ВыбратьБезИерархии.Ссылка КАК КонецДуги
		|ПОМЕСТИТЬ ЗамыканияДлины1
		|ИЗ
		|	Справочник.Номенклатура КАК ВыбратьБезИерархии
		|ГДЕ
		|	ВыбратьБезИерархии.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВыбратьБезИерархии.Ссылка,
		|	ВыбратьБезИерархии.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК ВыбратьБезИерархии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
		|	ВтораяДуга.КонецДуги КАК КонецДуги
		|ПОМЕСТИТЬ ЗамыканияДлины2
		|ИЗ
		|	ЗамыканияДлины1 КАК ПерваяДуга
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины1 КАК ВтораяДуга
		|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЗамыканияДлины1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
		|	ВтораяДуга.КонецДуги КАК КонецДуги
		|ПОМЕСТИТЬ ЗамыканияДлины4
		|ИЗ
		|	ЗамыканияДлины2 КАК ПерваяДуга
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины2 КАК ВтораяДуга
		|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЗамыканияДлины2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
		|	ВтораяДуга.КонецДуги КАК КонецДуги
		|ПОМЕСТИТЬ ЗамыканияДлины8
		|ИЗ
		|	ЗамыканияДлины4 КАК ПерваяДуга
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины4 КАК ВтораяДуга
		|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЗамыканияДлины4
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗамыканияДлины8.НачалоДуги КАК Предок,
		|	ЗамыканияДлины8.КонецДуги КАК Потомок,
		|	ЗамыканияДлины8.НачалоДуги.Код КАК КодМарки
		|ПОМЕСТИТЬ ВТ_СписокНоменклатуры
		|ИЗ
		|	ЗамыканияДлины8 КАК ЗамыканияДлины8
		|ГДЕ
		|	ЗамыканияДлины8.НачалоДуги <> ЗамыканияДлины8.КонецДуги
		|	И ЗамыканияДлины8.НачалоДуги В
		|			(ВЫБРАТЬ
		|				ВТ_Марки.Марка
		|			ИЗ
		|				ВТ_Марки КАК ВТ_Марки)
		|	И НЕ ЗамыканияДлины8.КонецДуги.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокНоменклатуры.Потомок КАК Потомок,
		|	ВТ_СписокНоменклатуры.КодМарки КАК КодМарки,
		|	ВТ_СписокНоменклатуры.Потомок.Код КАК КодНоменклатуры,
		|	ЦеныСрезПоследних.ТипЦены КАК ТипЦены,
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	ВТ_СписокНоменклатуры КАК ВТ_СписокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		|				&Период,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_СписокНоменклатуры.Потомок КАК ВТ_СписокНоменклатуры
		|						ИЗ
		|							ВТ_СписокНоменклатуры)
		|					И ТипЦены = &ТипЦены) КАК ЦеныСрезПоследних
		|		ПО ВТ_СписокНоменклатуры.Потомок = ЦеныСрезПоследних.Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Возврат РезультатЗапроса.Выгрузить(); 

КонецФункции	
