
Функция ШаблонGetPrice(Запрос)
	
	КодКлиента = Запрос.ПараметрыURL["CustomerCode"];
	КодЦены    = Запрос.ПараметрыURL["PriceTypeCode"];
	
	Если НЕ ЗначениеЗаполнено(КодКлиента) ИЛИ НЕ ЗначениеЗаполнено(КодЦены)Тогда
	       Ответ = Новый HTTPСервисОтвет(204); 
	Иначе
		   ТабЗнач = РаботаСЦенами.ПолучитьЦенуПоКонтаргентуИМарке(
				Справочники.Контрагенты.НайтиПоКоду(КодКлиента), 
				Справочники.ТипыЦен.НайтиПоКоду(КодЦены) );
													
		Если ТабЗнач.Количество() = 0 Тогда
			Ответ = Новый HTTPСервисОтвет(200);
			Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
			Ответ.УстановитьТелоИзСтроки("Не удалось найти данные удовлетворяющие вашему запросу!");
			Возврат Ответ
		Иначе
			
			МассивДанных = Новый Массив;
			
			Для Каждого СтрокаТЗ Из ТабЗнач Цикл
				МассивДанных.Добавить(Новый Структура("КодКонтрагента, КодМарки, КодНоменклатуры, Цена", КодКлиента, СтрокаТЗ.КодМарки, СтрокаТЗ.КодНоменклатуры, СтрокаТЗ.Цена ));
			КонецЦикла;	

			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, МассивДанных);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			
			Ответ = Новый HTTPСервисОтвет(200);
			Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		   
		КонецЕсли;
		
	КонецЕсли;	

	Возврат Ответ;
	
КонецФункции
