
Функция GetPrice(CustomerCode, PriceTypeCode)
	
	ТабЗнач = РаботаСЦенами.ПолучитьЦенуПоКонтаргентуИМарке(
				Справочники.Контрагенты.НайтиПоКоду(CustomerCode), 
				Справочники.ТипыЦен.НайтиПоКоду(PriceTypeCode) );

	РезультатВыполненияТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "РезультатВыполнения"); 			
	СоставТип = ФабрикаXDTO.Тип("http://www.sample-package.org", "Состав"); 			
	
	РезультатВыполнения =  ФабрикаXDTO.Создать(РезультатВыполненияТип);
	
	Если ТабЗнач.Количество() = 0 Тогда
		РезультатВыполнения = Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ТабЗнач Цикл
	
		Состав = ФабрикаXDTO.Создать(СоставТип);
		
		Состав.КодКонтрагента  = CustomerCode;
		Состав.КодМарки        = СтрокаТЗ.КодМарки;
		Состав.КодНоменклатуры = СтрокаТЗ.КодНоменклатуры;
		Состав.Цена            = СтрокаТЗ.Цена;
		
        РезультатВыполнения.СтрокаСостава.Добавить(Состав);
		
    КонецЦикла;
	
	Возврат РезультатВыполнения;
			
КонецФункции
